const db = require("better-sqlite3")(":memory:");

db.prepare(
  `
  CREATE TABLE IF NOT EXISTS products (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    title TEXT NOT NULL,
    slug TEXT NOT NULL UNIQUE,
    des TEXT NOT NULL,
    price INTEGER,
    img TEXT NOT NULL,
    totalprice INTEGER,
    by INTEGER,
    count INTEGER
  )
  `
).run();

db.prepare(
  `
  CREATE TABLE IF NOT EXISTS users (
    id INTEGER PRIMARY KEY AUTOINCREMENT,
    name TEXT NOT NULL,
    email TEXT NOT NULL UNIQUE,
    password TEXT NOT NULL,
    img TEXT,
    role TEXT NOT NULL DEFAULT 'user',
    createdAt DATETIME DEFAULT CURRENT_TIMESTAMP
  )
  `
).run();

const products = [
  {
    title: "وینچ برقی کاراگاهی ویتال مدل 400",
    slug: "winch",
    des: `
    برای بلند کردن اجسام تا ارتفاع 20 متر و وزن 200 کیلو گرم و ارتفاع 10 متر و وزن 400 کیلوگرم وینچ برقی ویتال بهترین پیشنهاد میباشد.وینچهای ویتال با سیم پیچ 100 درصد مس که بر روی کارتن قید شده است دارای بالاترین کیفیت می‌باشند.
    `,
    price: 6000000,
    totalprice: 7900000,
    by: 3,
    img: "/images/product1.webp",
    count: 128,
  },
  {
    title: "دریل چکشی مدل دیوالت مدل 778S2",
    slug: "drill",
    des: `DCD778S2 محصول دیگری از شرکت دیوالت می باشد که در گروه ابزارآلات شارژی قرار می گیرد و مجهز به موتور با تکنولوژی جدید بدون زغال یا براشلس می باشد. این دریل شارژی انرژی خود را از یک باتری 18 ولتی از نوع لیتیوم تامین می کند. همین باتری قدرت مورد نیاز برای کار با این دستگاه را فراهم می کند. هرچه ولتاژ باطری در دریل شارژی بيشتر باشد حجم ، گشتاور و قيمت دستگاه دریل شما نیز بالاتر می شود و دریل برای استفاده در كارهای سنگين مناسب تر خواهد بود. دریل شارژی دیوالت مدل DCD778S2 مجهز به گیربکس دو سرعته بوده که قادر است سه نظام را با دو سرعت مختلف 500-0 و 1750-0 دور در دقیقه به گردش در آورد. سه نظامی که بر روی این دستگاه قرار دارد قابلیت به کارگیری مته 1.5 تا 13 میلیمتری را دارد که در نتیجه می تواند سوراخی با ظرفیت 13 میلیمتر در فلزات و مصالح ساختمانی و سوراخی با ظرفیت 30 میلیمتر در چوب ایجاد کند. گشتاور این دریل شارژی 65 نیوتن متر است که قابلیت تنظیم شدن در 16 حالت مختلف را دارد و به دلیل قابلیت چکشی که دارد می تواند بر سطح مورد نظر ضربه وارد کند. به همراه این ابزار دیوالت یک عدد باتری و شارژر قرار دارد و داخل یک کیف در اختیار شما قرار می گیرد. این نوع دریل شارژی با دارا بودن قابلیت هایی بسیار مانند چراغ قوه ی داخلی،وزن سبک 1.52 کیلو گرمی متمایز در میان رقبا به شمار می آید. وزن بسیار سبک این دستگاه دستان شما را در مقابل خستگی در امان نگه میدارد. و با کار کردن در کارگاه های صنعتی هیچگونه مشکل یا خستگی را برای شما به همراه ندارد.`,
    price: 18000000,
    totalprice: 20000000,
    by: 6,
    img: "/images/product2.webp",
    count: 5,
  },
  {
    title: "کلاه ایمنی مدل 7",
    slug: "hat",
    des: `کلاه ایمنی مدل ۷ یکی از باکیفیت‌ترین و کاربردی‌ترین تجهیزات ایمنی شخصی است که برای حفاظت از سر در محیط‌های کاری، صنعتی و ساختمانی طراحی شده است. این کلاه با بهره‌گیری از مواد اولیه مرغوب و طراحی ارگونومیک، ایمنی بالا و راحتی را به طور هم‌زمان فراهم می‌کند.`,
    price: 60000,
    totalprice: 86000,
    by: 85,
    img: "/images/product3.png",
    count: 36,
  },
  {
    title: "عینک ایمنی جوشکاری",
    slug: "glasses",
    des: `
    عینک ایمنی جوشکاری مدل ۲۱ انتخابی حرفه‌ای برای محافظت از چشم‌ها در برابر خطرات ناشی از جوشکاری، سنگ‌زنی، و دیگر فعالیت‌های صنعتی است. این عینک با بهره‌گیری از طراحی ارگونومیک و استفاده از عدسی‌های مقاوم، ایمنی کامل را در محیط‌های کاری پرخطر فراهم می‌کند.`,
    price: 62000,
    totalprice: 112000,
    by: 30,
    img: "/images/product4.png",
    count: 26,
  },
  {
    title: "جلیقه اضطراری مدل 50",
    slug: "vest",
    des: `جلیقه اضطراری مدل ۵۰، یک انتخاب ایده‌آل برای شرایط بحرانی و مواقع اضطراری است. این جلیقه با طراحی کاربردی و استفاده از مواد با کیفیت، تضمین‌کننده‌ی ایمنی و راحتی شما در شرایط خاص می‌باشد.`,
    price: 184000,
    totalprice: 235000,
    by: 48,
    img: "/images/product5.png",
    count: 9,
  },
  {
    title: "محافظ گوش تک پلاست مدل ۷۶",
    slug: "ear",
    des: `آرامش در محیط‌های پر سر و صدا، با محافظتی مطمئن

محافظ گوش مدل ۷۶ از برند معتبر تک پلاست، انتخابی ایده‌آل برای حفاظت مؤثر از شنوایی در محیط‌هایی با سطح نویز بالا است. طراحی ارگونومیک، کیفیت ساخت بالا و استفاده از مواد اولیه ضد حساسیت، این محصول را به یکی از بهترین گزینه‌ها برای کارگران، مهندسان و کاربران حرفه‌ای تبدیل کرده است.`,
    price: 87000,
    totalprice: 116000,
    by: 8,
    img: "/images/product6.png",
    count: 0,
  },
  {
    title: "دریل پیچ گوشتی شارژی چکشی جاب مدل JB-4890 P",
    slug: "drill-chakoshi",
    des: `دریل پیچ‌گوشتی شارژی چکشی جاب مدل JB-4890 P نمونه‌ای از ترکیب هوشمندانه قدرت، قابلیت‌های کاربردی و طراحی متناسب با نیاز کاربران خانگی و حرفه‌ای است. این ابزار با در اختیار داشتن ویژگی‌های فنی پیشرفته مانند سیستم ضربه‌زن، کنترل سرعت، سه‌نظام فلزی، و بهره‌گیری از باتری قدرتمند ۴۸ ولتی، خود را در میان محصولات سطح بالای بازار جای داده است. برخورداری از مجموعه‌ای متنوع از اقلام همراه، این مدل را به ابزاری کامل و آماده برای انجام طیف وسیعی از فعالیت‌های فنی تبدیل کرده است. در ادامه، به بررسی دقیق این دریل خواهیم پرداخت.`,
    price: 4200000,
    totalprice: 5600000,
    by: 11,
    img: "/images/product7.webp",
    count: 3,
  },
  {
    title: "نردبان ۴ پله ماندگار مدل جلوه",
    slug: "nardebam",
    des: `نردبان ۴ پله مدل جلوه از برند ماندگار، ترکیبی از طراحی مدرن، کیفیت ساخت بالا و ایمنی استاندارد است که برای استفاده خانگی و نیمه‌صنعتی ایده‌آل می‌باشد. این نردبان با ساختار مقاوم و وزن سبک، انتخابی مطمئن برای انجام کارهای روزمره در منزل، فروشگاه، دفاتر یا کارگاه‌های کوچک است.`,
    price: 184300,
    totalprice: 200000,
    by: 46,
    img: "/images/product8.png",
    count: 36,
  },
];

function initProducts() {
  const stmt = db.prepare(`
    INSERT INTO products (
      title, slug, des, price, img, totalprice, by, count
    ) VALUES (
      @title, @slug, @des, @price, @img, @totalprice, @by, @count
    )
  `);

  for (const product of products) {
    stmt.run(product);
  }
}

const users = [
  {
    name: "Admin User",
    email: "admin@example.com",
    password: "hashed_password_here",
    img: "/img/admin.jpg",
    role: "admin",
  },
  {
    name: "Regular User",
    email: "user@example.com",
    password: "hashed_password_here",
    img: "/img/user.jpg",
    role: "user",
  },
];

function initUsers() {
  const stmt = db.prepare(`
    INSERT INTO users (name, email, password, img, role) VALUES (
      @name, @email, @password, @img, @role
    )
  `);

  for (const user of users) {
    stmt.run(user);
  }
}

initProducts();
initUsers();
